// Check Yourself!

// Задание №1
// Создайте функцию которая принимает в качестве
// аргумента два числа и возвращает их сумму.

//?----------------------------------------

// Задание №2
// Напишите функцию которая принимает
// массив с названиями стран и возвращает
// страну с самым длинным названием,
// затем напишите вторую функцию которая возвращает
// страну с самым коротким названием.

// let arr = ["Apple", "Orange", "Banana", "Pineapple", "Cherry"];
// let max = arr[0];
// for (let i of arr) {
//   if (max.length < i.length) {
//     max = i;
//   }
// }

// console.log(max);

// let min = arr[0];
// for (let i of arr) {
//   if (min.length > i.length) {
//     min = i;
//   }
// }

// console.log(min);

//?----------------------------------------

// Задание №3
// Функция принимает параметр min.
// В нем лежит число от 0 до 59.
// Функция должна возвращать в какую четверть
// часа попадает это число (в первую, вторую,
// третью или четвертую).

//?----------------------------------------

// Задание №4
// Создайте функцию которая принимает строку, удаляет все гласные буквы из строки,
// а согласные буквы в свою очередь переводит в заглавные и возвращает новую строку.
// Например: ввод - 'hello', функция должна возвратить 'HLL'

// let str = "hello";
// let res = str.split("");
// for()

// console.log(res);

// for(let i of res){
//     if(i==="o";i==="e"){
//     console.log(res.slice());

//     }
// }

//?----------------------------------------

// Задание №5
// Напишите цикл, который за 7 вызовов console.log выводит такой треугольник:

// let hash = "#######";
// let i = 1;
// while (i <= 7) {
//   console.log(hash.slice(0, i));
//   i++;
// }
// while (i >= 1) {
//   console.log(hash.slice(0, i));
//   i--;
// }
// console.log();

// #
// ##
// ###
// ####
// #####
// ######
// #######
// ######
// #####
// ####
// ###
// ##
// #

//?----------------------------------------

// Задание №6
// let arr = [1, 2, 3, 3, 4, 5];

// for(let i=0;i<arr.length;i++){

// }
// Найти индекс второго числа 3
